# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, 
# если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
s = int(input('Сколько всего журавликов? '))
print(f'Петя сделал {int(s/4)} журавликов, ' 
      f'Катя сделала {int(s/2)} журавликов, ' 
      f'Сережа сделал {int(s/4)} журавликов')
